const knowledgeData = [
    {
        id: 1,
        title: "信号与系统",
        content: `信号与系统是电子信息、通信工程、自动化等专业的核心课程，主要研究信号的表示、变换、处理以及系统的特性分析。它为后续学习通信原理、数字信号处理等课程奠定基础，在现代科技领域如5G通信、人工智能信号处理等方面有着广泛应用。`,
        children: [
            {
                id: 101,
                title: "基础概念",
                content: `信号(Signal) 是随时间变化的某种物理量，用于传递信息。它可以是电压、电流、温度、声音、图像，甚至股票价格。
    常见信号形式：
        电压随时间变化 x(t) 、声音的波形 、数字数据x[n]
    数学表达：
        连续时间信号：x(t), t∈R
        离散时间信号：x[n], n∈Z 
系统(System) 是对输入信号进行变换的物理或数学装置，它接收输入信号 x(t)，产生输出信号 y(t)。数学模型可写为：y(t)=T{x(t)}其中 T{⋅} 表示系统对信号的处理规则。
    例子:
        音响：把电信号变为声音
        滤波器：抑制噪声、保留有用信号
        电路：改变信号形态（如放大、延迟等）`,
                children: [
                    {
                        id: 10101,
                        title: "信号的分类与表示",
                        content: `信号可分为连续时间信号和离散时间信号等多种类型，不同类型信号有不同的表示方法。
1.连续时间信号：
    定义：定义在连续时间轴上的信号，任意时刻都有定义。
    数学表示：x(t)，其中 t∈R
    例子：
        - 正弦信号：x(t)=sin(2πt)
        - 指数衰减信号：(x(t)=e^{-t}u(t)
    应用：模拟音频、温度传感器输出等

2.离散时间信号：
    定义：仅在整数时间点有定义的信号。
    数学表示：x[n]，其中 n∈Z
    例子：
        单位冲击信号：x[n]=δ[n]
        余弦函数：x[n]=cos(0.2πn)
    应用：数字通信、音频采样、图像处理

3.周期信号与非周期信号
    周期信号：
        连续时间：存在 𝑇>0，使得 𝑥(𝑡)=𝑥(𝑡+𝑇) 对所有 𝑡 成立
        离散时间：存在整数 𝑁>0，使得 x[n]=x[n+N]
    非周期信号：不满足以上条件
    例子：
        周期：𝑥(𝑡) = cos(2π𝑡)
        非周期：𝑥(𝑡) = e^{-t}

4.能量信号与功率信号
    能量信号：
        E = ∫{-∞,∞}|x(t)|²dt < ∞;
        信号在整个时间内积累的能量有限。
    功率信号：
        P = lim{T->∞}{1/2T}∫{-T,T}|x(t)|^2dt < ∞;
        平均功率有限但总能量无限，常用于周期信号。
    注意：不能同时是能量信号和功率信号！！！！！！
`
                    },
                    {
                        id: 10102,
                        title: "系统的分类与特性",
                        content: `系统的基本概念：在信号与系统课程中，系统通常是指：一个对输入信号进行处理，生成输出信号的装置、算法或过程。系统可分为连续时间系统和离散时间系统，具有线性、非线性、时不变、时变等特性。
            1.连续时间系统与离散时间系统：
                1.连续时间系统：输入输出信号是连续时间信号（如电压、电流）。
                    例子：模拟电路，如RLC电路。
                2.离散时间系统：输入输出信号是离散时间信号（在离散时间点才有定义）。
                    例子：数字滤波器、计算机程序。

            2.线性系统与非线性系统：
                1.线性系统：输入信号的线性组合可以得到输出信号的线性组合。满足两个性质：
                    1.齐次行：T{a·x(t)}=a·T{x(t)}
                    2.可加性：T{x1(t)+x2(t)=T{x1(t)+x2(t)}}
                    例子：RLC电路、数字滤波器。
                2.非线性系统：输入信号的线性组合不能得到输出信号的线性组合。
                    例子：模拟电路、数字滤波器。
            
            3.时不变系统与时变系统
                1.时不变系统：系统的行为不随时间变化。若输入延迟，输出也只延迟相同时间。
                      验证：若 x(t)→y(t)，则 x(t-t0)→y(t-t0)
                2.时变系统：系统的行为随时间变化。

            4. 因果系统与非因果系统        
                1.因果系统：输出在任意时刻只依赖于当前和过去的输入。y(t)=f(x(τ)),其中τ≤t 
                2.非因果系统：输出依赖于未来的输入值。只能用于理论分析，不可实现。

            5. 稳定系统与不稳定系统（BIBO稳定性）  
                1.稳定系统：系统在任意时刻的输入信号的绝对值之和小于无穷大。
                2.不稳定系统：系统在任意时刻的输入信号的绝对值之和大于无穷大。
                BIBO稳定（有界输入 → 有界输出）：
                    若对所有有界输入 ∣x(t)∣<M，输出也满足 ∣𝑦(𝑡)∣<𝑁∣y(t)∣<N，则系统是稳定的。
             
            6. 可逆系统与不可逆系统
                可逆系统：存在一个系统能够从输出 y(t) 唯一恢复输入 x(t)。即系统具有唯一的逆系统。
                   
            7.  静态系统与动态系统  
                1.静态系统（无记忆）：输出仅依赖当前输入。
                    例：y(t)=3x(t)
                2.动态系统（有记忆）：输出依赖于过去或未来的输入。
                    例：y(t)=x(t)+x(t−1)
                `
                    }
                ]
            },
            {
                id: 102,
                title: "时域分析",
                content: `时域分析的基本概念：时域分析是指在时间的维度上分析信号和系统的性质与行为，直接处理信号的原始形式 x(t) 或 x[n]，不依赖频域或变换方法。
    在实际工程中，时域分析常用于：
        分析电路响应（如RC、RL、RLC电路）
        模拟信号的处理
        控制系统的响应分析
        `,
                children: [
                    {
                        id: 10201,
                        title: "信号的时域描述",
                        content: `包括单位冲激信号、单位阶跃信号、指数信号、正弦信号等多种信号的时域特性描述。
    1.单位冲激信号：
        定义：单位冲激信号(Unit Impulse Signal),又称狄拉克函数(Dirac delta function),是时域分析中最基本和最重要的信号之一，用于描述系统对瞬时输入的响应，在连续与离散系统中都具有核心地位。
        单位冲激信号用符号表示为：
            ·连续信号：  δ(t)
            ·离散信号：  δ[n]
        单位冲激信号的数学表达：
            1.连续时间单位冲激信号δ(t)
                严格意义上，δ(t) 不是传统意义上的函数，而是一种“广义函数”或“分布”，具有以下性质：
                1.非零仅在t = 0
                    δ(t) = 0, t ≠ 0
                2.面积为1
                    ∫{-∞,∞}δ(t)dt = 1
                3.抽样性质：
                    ∫{-∞,∞}x(t)δ(t-t0)dt = x(t0)
                4.与系统卷积
                    x(t)*δ(t) = x(t) 这意味着冲激函数是卷积的单位元。
            2.离散时间单位冲激信号δ[n]
                离散冲激信号是一个简单的数列，定义如下：
                        δ[n] = {1 ,n=0 
                                   {0 ,n≠0

    2.单位阶跃信号：
        定义:单位阶跃信号(Unit Step Signal)是一种在某一时刻“由0突变为1”的基本信号,常用来模拟开关电源、电路开通、系统初始化等瞬间变化的行为。在时域分析中，它是构建和理解其他信号的重要工具。
        单位阶跃信号的数学表示如下：
            ·连续时间:
                u(t) = {1 ,t ≥ 0
                           {0 ,t < 0}
            ·离散时间:
                u[n] = {1 ,n ≥ 0
                           {0 ,n < 0
        单位阶跃信号的数学性质：
            1.移位性质：
                u(t-t0) = {0 , t < t0
                               {1 ,t ≥ t0
                代表信号在 t = t0开始“跳跃”到1。

            2.与其他函数的乘积：
                将任意信号 x(t) 限定在 t≥0 的范围: x(t)⋅u(t) 表示“截断”信号或将其“从0开始”。         
            
            3.与冲激信号的关系：
                ·连续时间：du(t)/dt = δ(t)
                ·离散时间：δ[n] = u[n] - u[n-1]
                阶跃是冲激的积分，冲激是阶跃的微分/差分。
            
        其中，指数信号和正弦信号是连续时间系统分析中极为重要的两类基本信号，在线性时不变系统（LTI）分析、频域变换和稳定性分析中起核心作用。
        3.指数信号
            定义：
                连续时间指数信号的标准形式为: x(t)=Ae^(at)
                ·A: 振幅 (可以是实数或复数)
                ·a: 指数增长/衰减率（实数或复数）
                ·t: 连续时间变量 
                离散时间指数信号：𝑥[n]=Ar^n
                ·r > 1: 指数增长
                ·0 < r < 1: 指数衰减
                ·r < 0: 振荡性指数（交替正负）
        4.正弦信号
            1.定义：
                连续时间正弦信号的标准形式为: 
                    余弦信号: x(t)=Acos(ωt+φ)
                    正弦信号: x(t)=Asin(ωt+φ)
                ·A: 振幅
                ·ω: 角频率
                ·φ: 初相位
                ·t: 连续时间变量
            2.正弦信号的复指数表示(欧拉公式)：
                e^(jωt)=cos(ωt)+jsin(ωt)
                正弦信号可以用复指数组合表示：
                    cos(ωt)={e^(jωt)+e^(-jωt)}/2
                    sine(ωt)={e^(jωt)-e^(-jωt)}/2j
            3.离散时间正弦信号：
                x[n]=Acos(ωn+φ)
                ·频率在离散域中的范围为 [0,𝜋]
                ·当 𝜔 为有理数倍于 𝜋, 信号为周期信号

                `
                    },
                    {
                        id: 10202,
                        title: "系统的时域描述",
                        content: `连续时间系统用微分方程描述，离散时间系统用差分方程描述，还有线性系统、非线性系统等不同特性描述。
一、系统时域描述概述
    在信号与系统分析中，时域描述法是最直接的一种方法。它通过描述系统在时间上的输入输出关系，揭示系统的动态特性。
    **常见的时域描述方法包括：
        连续时间系统 ➤ 微分方程（Differential Equation）
        离散时间系统 ➤ 差分方程（Difference Equation）
        LTI系统（线性时不变） ➤ 可进一步使用冲激响应与卷积描述

二、连续时间系统的微分方程描述
    微分方程的基本形式：
        a[n]{d(n)y(t)/dt(n)}+a[n-1]{d(n-1)y(t)/dt(n-1)}+···+a[0]y(t) = b[m]{d(m)x(t)/dy(m)}+···+b0x(t)
        x(t)：输入信号
        y(t)：输出信号
        ai,bj:常系数（系统参数）
     要点说明：
        这是描述系统行为的动态方程，适用于多种工程系统（如电路、机械系统等）
        系统的阶数由最高阶导数决定(即 n )

    举例：一个简单的一阶低通滤波器可用如下方程描述：
        dy(t)/dt + y(t) = x(t)

物理意义理解：

        输出的变化率（导数）和当前输出状态、输入信号之间存在关系。

        系统“记忆性”来源于导数项 ➤ 多阶导数反映系统的“惯性”或“动态积累”能力。

三、离散时间系统的差分方程描述
    差分方程的基本形式：
        y[n] + a1y[n-1] + a2y[n-2] + ··· + aNy[n-N] = b0x[n] + b1x[n-1] + b2x[n-2] + ··· + bMx[n-N]
        
        ·y[n]:系统输出
        ·x[n]:系统输入
        ·ai,bj:系统系数
    特点：
       仅包含延迟项（过去的输入与输出）
        表示系统对离散序列的处理过程
        广泛应用于数字滤波器设计（IIR、FIR）
        
    举例：简单的一阶递归滤波器：
        y[n] = 0.5y[n-1] + x[n]

时域行为分析：
    系统当前的输出不仅依赖当前输入，还依赖过去的输出（反映系统的“记忆”）。
    当只依赖输入项时（无 y[n-k] 项）,称为非递归系统(FIR)

四、线性系统与非线性系统的时域描述
    线性系统(Linear System)
    满足叠加性（加法性 + 齐次性）
    若系统输入为 x1(t)->y1(t),x2(t)->y2(t),则有 ax1(t)+bx2(t)->ay1(t)+by2(t)
    在时域描述中，线性系统对应线性微/差分方程：输出和输入及其导数项均以线性形式出现，没有乘积、非线性函数（如正弦、指数、平方等）参与。

    非线性系统(Nonlinear System)
    不满足叠加性，常出现如下情况：
    出现非线性函数: 如y(t)^2,sin(y(t)),e^y(t)
    系统输出和输入之间包含乘积项:如x(t)y(t)

时域角度的判断方法：
    看输出是否是输入的“线性组合”
    看方程中是否含有非线性运算（如平方、开方、乘积）`
                    },
                    {
                        id: 10203,
                        title: "卷积",
                        content: `连续时间卷积和离散时间卷积是时域分析中的重要运算，用于求解系统响应。
一、什么是卷积？为什么学习卷积？
        在分析**线性时不变系统(LTI系统)**时，我们最关心的是：当输入信号 x 进入系统，输出信号 y 是什么？   
        对于 LTI系统，我们有一个非常重要的结论：
            系统的输出 = 输入信号 与 系统冲激响应 的卷积           
         
二、连续时间卷积
    1.定义
        设连续时间系统的输入为 x(t)，单位冲激响应为 h(t)，则系统输出为：
            y(t) = x(t) * h(t) = ∫{-∞,∞}x(τ)h(t-τ)dτ
        这个积分称为卷积积分     ∗表示卷积运算
    
    2.卷积的图形操作法（五步法）
        为了帮助学生理解抽象的积分过程，使用图形卷积法进行讲解：
            1)翻转: h(t) -> 得到 h(-τ)
            2)平移: h(-τ) -> 得到 h(t-τ)
            3)相乘: x(τ)·h(t-τ)
            4)积分: 计算重叠区域的面积
            5)重复: 改变 t,对所有 t 求得 y(t)
    
三、离散时间卷积
    1. 定义
        若离散时间系统输入为 x[n], 单位冲激响应为 h[n],则输出为：
            y[n] = x[n] * h[n] = ∑{k=-∞,∞} x[k]·h[n-k]
            这个求和称为卷积和
            每个时刻 n, 通过输入和冲激响应的“反转加权求和”获得输出
        
    2. 图形卷积法
        与连续时间类似，离散时间卷积的可视化方法为：
            1.翻转 h[k] 得到 h[-k]
            2.平移得到 h[n-k]
            3.对 k 逐项乘积 x[k] ·  h[n-k]
            4.对所有 k 求和
   
四、卷积的物理意义
    卷积描述了系统如何对输入信号做出响应。本质上是：
        ****系统响应 = 输入中每个时间点产生的冲激响应的加权叠加****
    每个 x(t) 产生一个“缩放版”的 h(t)
    所有“缩放版响应”叠加得到总响应 y(t)

五、卷积的性质（适用于连续与离散）
    交换性                          x * h = h * x                                输入与系统可互换
    结合性                          x *(h1 * h2) = (x * h1) * h2             系统可串联组合
    分配性                          x * (h1 + h2) = x * h1 + x * h2            系统并联组合
    与冲激函数的卷积        x * δ=x                                            冲激函数为单位元素

六、卷积与系统响应的关系
    连续时间 LTI 系统                       y(t) = x(t) * h(t)
    离散时间 LTI 系统                       y(n) = x(n) * h(n)
    物理解释	                        每个输入“片段”引起冲激响应，所有响应累加形成输出
    `
                    }
                ]
            },
            {
                id: 103,
                title: "频域分析",
                content: `一、什么是频域分析？
    1.基本概念：
        时域（Time Domain）：描述信号随时间变化的方式
        频域（Frequency Domain）：描述信号中包含哪些频率成分及其强度
        ****频域分析就是将信号从“时间”维度转换到“频率”维度，以便分析信号的周期性、带宽、系统滤波特性等。****
    2.为什么要频域分析？
        简化系统分析与求解
        揭示信号的本质（如频谱）
        分析系统的频率响应
        对信号进行滤波、调制、通信分析等操作
二、频域工具
    工具                           适用信号类型            定义域                          作用
    傅里叶变换(FT)            连续时间                 ω                              分解为连续频率成分
    拉普拉斯变换(LT)         连续时间                 s = jω + σ                 更通用，分析收敛性
    Z变换                           离散时间                 z = re^jw                  包括DTFT与收敛性分析
    `,
                children: [
                    {
                        id: 10301,
                        title: "傅里叶分析",
                        content: `一、傅里叶分析分析简介
    傅里叶分析是将信号分解为一系列正弦和余弦信号或复指数信号的过程。
    包括两大类工具：    
        傅里叶级数（Fourier Series）：适用于周期信号
        傅里叶变换（Fourier Transform）：适用于非周期信号                    

二、连续时间傅里叶级数（CTFS）
    1.适用范围：周期连续时间信号
        若 x(t) 是周期为 T 的信号，则它可以展开为复指数形式：
            x(t) = ∑ {k=-∞,∞}C_k e^(jkω0t)
        其中：
            ω0 = 2π/T ：基频角频率
            C_k ：傅里叶系数，表示信号中第 k 个频率分量的强度与相位
    2.傅里叶系数计算公式：
        C_k = 1/T ∫ {x(t)e^(-jkω0t)} dt          说明：傅里叶级数是将信号展开为离散的频率分量。
    3.实例: x(t)=cos(ω0t)
        展开为：
            x(t)=1/2(e^(jω0t)+e^(-jω0t))
            傅里叶系数：C1 = 1/2    C-1 = 1/2  其他为0

三、离散时间傅里叶级数（DTFS）
    1. 适用范围：周期离散时间信号
        周期为 N 的离散信号 x[n] 可表示为：x[n] = ∑ {k=0,N-1}C_k e^(j(2𝜋/N)kn)
        C_k: 第 k 个离散频率的系数
        周期性导致频域也具有周期性（周期为 𝑁)
    2.系数公式：
        C_k = 1/N ∑{n=0,N-1} {x[n]e^(-j(2𝜋/N)kn)}
    3.DTFS特性：
        离散时间 + 周期信号 → 离散频谱 + 周期频域
        周期性带来频谱折叠（aliasing）

四、连续时间傅里叶变换（CTFT）
    1. 适用范围：非周期、连续时间信号
        X(w) = ∫{-∞,∞} {x(t)e^(-jwt)} dt
        ·X(w): 信号在频率 𝜔 处的频谱值
    2.反变换：
        x(t) = 1/2𝜋 ∫{-∞,∞} X(w)e^jwt dw

五、离散时间傅里叶变换（DTFT）
    1. 适用范围：非周期、离散时间信号
        X(e^jw) = ∑ {n=-∞,∞} {x[n]e^(-jwn)} 
        ·w ∈ [-𝜋,𝜋]: 归一化角频率（单位 rad/sample)
    2.反变换：
        x[n] = 1/2𝜋 ∫{-𝜋,𝜋} {X(e^jw)e^jwn} dw
    
六、频谱：幅频特性与相频特性
    1. 幅度谱（Magnitude Spectrum）
        表示信号在不同频率上的强度    |X(w)| 或 |X(e^jw)|
    2.相位谱（Phase Spectrum）
        表示信号中各频率成分的相对位移（相位）  ∠X(ω) 或 ∠X(e^jω)
    3. 幅频响应与相频响应（系统特性）
        对 LTI 系统，系统对频率w的响应由传递函数H(w) 或 H(e^jw)给出：
        · 幅频特性: |H(w)|
        · 相频特性: ∠H(w)
        **** 频率响应决定了系统对不同频率输入信号的增益与相移！****   

七、性质总结    
        傅里叶分析通用性质（适用于 FS 和 FT）：  
        性质                               表达式                                                     含义
        线性                           ax1+bx2<->aX1+bX2                           可叠加分析
        平移                           x(t-t0)<->e^(jwt0)X(w)                          相位变化
        频移                           e^(jw0t)x(t)<->X(w-w0)                         频谱平移  
        时域卷积                    x*h<->X(w)·H(w)                                  系统响应简化
        乘积定理                    x(t)*h(t)<->X(s)*H(s)                              时域乘积 = 频域卷积
        `
                    },
                    {
                        id: 10302,
                        title: "拉普拉斯变换",
                        content: `拉普拉斯变换是连续时间信号和系统分析的重要工具，它将时域微分方程问题转化为频域代数问题，简化系统分析。
相比傅里叶变换，它适用于更广泛的信号（如指数增长信号）和非稳态系统。`,
                        children: [
                            {
                                id: 1030201,
                                title: "拉普拉斯变换定义与性质",
                                content: `拉普拉斯变换的定义
    *单边拉普拉斯变换(Unilateral Laplace Transform)
        L{x(t)} = X(s) = ∫{0,∞}x(t)e^(-st)dt
        ·适用于因果系统即x(t) = 0, t < 0
        ·常用于系统初始条件存在的情况

    *双边拉普拉斯变换(Bilateral Laplace Transform)
        L{x(t)} = X(s) = ∫{−∞,∞}x(t)e^(-st)dt
        ·更一般，但在系统分析中多采用一边形式

    *变量说明
        s = σ + jω: 复频域变量
        X(s)：拉普拉斯变换后的复频域函数（频域表示）

拉普拉斯变换的物理意义:
    将时域函数转化为复频域中的代数函数
    s 的实部 𝜎 控制指数增长/衰减，虚部 𝑗𝜔 控制振荡频率
    是傅里叶变换的推广：令 s=jω, 即变为傅里叶变换 `
                            },
                            {
                                id: 1030202,
                                title: "拉普拉斯变换收敛域",
                                content: `定义：
    ·指拉普拉斯变换积分存在的 s 的取值范围
    ·表示复平面中对 X(s) 收敛的区域

常见情况及其 ROC:
    信号类型                    示例                      ROC
    因果                       e^(-at)u(t)              ℜ(s)> −a
    反因果                    e^(bt)u(-t)              ℜ(s)<b
    双边                       e^(−at)           
   
ROC的重要性：  
    1. 决定变换是否存在
    2. 唯一确定 x(t)（不同 ROC → 不同反变换）
    3. 稳定性与因果性分析的依据

拉普拉斯变换的基本性质   
    性质名称                            数学表达                                                    含义
    线性                            ax1(t)+bx2(t)<->aX1(s)+bX2(s)                       可叠加
    时移                            x(t-t0)u(t-t0)<->e^(-st0)X(s)                     延迟导致频域乘以指数          
    频移                            e^(at)x(t)<->X(s-a)                                 频域平移
    微分                            dx(t)/dt<->sX(s)-x(0-)                             微分变代数乘   
    积分                            ∫{0,t}x(τ)dτ<->(1/s)X(s)                           积分变除法      
    卷积                            x(t)*h(t)<->X(s)*H(s)                                时域卷积 = 频域乘积
    初值定理                       x(0+) = lim s→∞ sX(s)                              快速估计初值     
    终值定理                       x(∞) = lim s→0 sX(s)                                稳态估值    
    `
                            },
                            {
                                id: 1030203,
                                title: "拉普拉斯变换系统函数",
                                content: `系统函数 H(s) 与系统分析
    1. 定义：
        对于线性时不变（LTI）系统，输入为 x(t)，输出为 y(t)，系统函数 H(s) 为：H(s) = Y(s)/X(s) 是系统对任意输入的“响应率”，等价于系统的传递函数
    2. 求解系统输出（频域法）：
        Y(s) = H(s)X(s)然后通过反拉普拉斯变换回到时域
    3. 零点与极点
        系统函数通常为有理函数：H(s) = {(s-z1)(s-z2)···}/{(s-p1)(s-p2)···}
        零点 (z) : 使分子为0
        极点 (p) : 使分母为0 → 主导系统行为
    `
                            }
                        ]
                    },
                    {
                        id: 10303,
                        title: "Z变换",
                        content: `Z变换的背景与作用
    ·Z变换是离散时间信号与系统分析的基本工具。
    
    ·它将时域序列转换为复平面上的代数表达式，便于分析差分方程、系统稳定性、因果性、频率响应等。
    
    ·Z变换相当于离散时间中拉普拉斯变换的对应形式。    
    `,
                        children: [
                            {
                                id: 1030301,
                                title: "Z变换的定义与性质",
                                content: `Z变换的定义
    1. 双边 Z 变换（Bilateral Z-Transform）
        X(z) = ∑ {n=-∞,∞}x[n]z^(-n)
        适用于非因果或双边信号分析。
        更全面但计算较复杂。

    2. 单边 Z 变换（Unilateral Z-Transform）
        X(z) = ∑ {n=0,∞}x[n]z^n
        仅考虑 𝑛 ≥ 0多用于因果系统分析
        常用于求解带初始条件的差分方程

    3.变量说明：
        z：复频域变量
        X(z)：Z变换结果，是复变量函数  
        通常z=re^jω ，将模和角度表示复数  

Z变换的物理意义
    将时间序列x[n] 映射为复平面中的复函数 X(z)
    包含了信号的 频率特性 和 增长/衰减趋势
    是离散时间傅里叶变换（DTFT）的推广
        `
                            },
                            {
                                id: 1030302,
                                title: "Z变换的收敛域",
                                content: `定义：
    ROC 是使得 Z 变换级数收敛的复平面区域

不同信号的 ROC 举例：
    信号类型                               形式                              
    右边（因果）                         a^n * u[n]
    左边（反因果）                       -a^n * u[-n-1]
    双边（两边有值）                     a^n

ROC的重要性：
    1. 决定变换是否存在
    2. 唯一确定 x[n]（与 X(z) 联合唯一）
    3. 用于因果性与稳定性分析

ROC判断因果与稳定性：
    性质                                ROC条件
    因果系统                            ROC 为外部区域（即包括 ∞）
    非因果系统                           ROC 为内部区域（即包含原点）
    稳定系统                            ROC 包含单位圆
    因果 + 稳定                          所有极点在单位圆内

Z变换的基本性质
    性质                                    数学表达                                                         含义说明
    线性                             ax1(n)+bx2(n)<->aX1(z)+bX2(z)                        满足叠加   
    时移                             x[n-n0]<->z^-n0X(z)                                       推迟导致乘以z^(-n0) 
    频移                            a^n x[n]<->X(z/a)                                            压缩或扩展频域
    反转                             x[-n]<->X(1/z)                                                  时间反转变换
    卷积                             x[n]*y[n]<->X(z)Y(z)                                        卷积定理
    初值定理                          x[0] = lim z→∞ X(z)                                       快速求首项
    终值定理                          x[∞] = lim z→1 (1-z^-1)X(z)                            快速求稳态值
    `
                            },
                            {
                                id: 1030303,
                                title: "Z变换的系统函数",
                                content: `系统函数 H(z) :Z域下的系统描述
    1.系统函数定义：
        H(z) = Y(z)/X(z)
        描述系统对任意输入的变换关系
        是差分方程在Z域下的代数表达
    
    2.极点与零点
        ·零点：使分子为000
        ·极点：使分母为0（系统不稳定点）
        Z变换的极点分布决定了系统的稳定性

    3.差分方程建模与求解：
        例：系统由方程定义：y[n] - 3/4 * y[n-1]  = x[n]
        z变换两边得:
            Y(z)(1-3/4*z^-1) = X(z) ⇒ H(z) = Y(z)/X(z) = 1/(1-3/4*z^-1)

    4.稳定性与因果性判断：
        1.系统是否稳定：
            所有极点在单位圆内

        2.系统是否因果：
            ROC 为极点之外（外环）
                                `
                            }
                        ]
                    }
                ]
            },
            {
                id: 104,
                title: "系统特性分析",
                content: `系统特性分析是对信号通过系统后的处理方式进行理解和分类，是掌握系统行为的基础。常见系统特性包括：

1.线性性（Linearity）

2.时不变性（Time Invariance）

3.因果性（Causality）

4.稳定性（Stability）

5.记忆性（Memory）

6.可逆性（Invertibility）

这些特性决定了系统的行为模式，是后续进行系统分析（如时域、频域分析）的基础。
                `,
                children: [
                    {
                        id: 10401,
                        title: "系统的频率响应",
                        content: `1. 定义
    频率响应描述系统对不同频率输入信号的响应特性，是分析线性时不变系统（LTI系统）频域特性的关键工具。
    对于 LTI 系统，若输入为复指数信号：
        x(t) =  e^(jωt) 或 x[n] = e^(jωn)
    系统响应为：
        y(t) = H(jω)e^(jωt) 或 y[n] = H(e^jω)e^(jωn)   其中H(jw)或H(e^jω)为系统的频率响应。

2.连续时间系统频率响应
   若系统冲激响应为 h(t)，其频率响应为傅里叶变换： 
        H(jw) = ∫{-∞,∞}h(t) e^(-jwt)dt 

3.离散时间系统频率响应
    若系统冲激响应为 h[n], 其频率响应为 DTFT（离散时间傅里叶变换）：
        H(e^jω) = ∑ {n=-∞,∞}h[n] e^(-jωn)

4.幅频特性与相频特性
    ·幅频特性：描述系统对不同频率的幅度放大/衰减
        |H(jw)| 或 |H(e^jω)|
    ·相频特性：描述系统对不同频率的相位延迟
        ∠H(jw) 或 ∠H(e^jω)

5.例子说明
    若 h[n] = (0.5)^n u[n], 则：
        H(e^jω) = ∑ {n=-∞,∞}h[n] e^(-jωn) = ∑ {n=-∞,∞} (0.5)^n e^(-jωn) = 1/(1-0.5e^(-jω))     取模得幅频响应，取角度得相频响应。
    
6.频率响应图形
    ·频率响应可以画出 幅频曲线（Gain vs Frequency）和相频曲线（Phase vs Frequency）
    ·用于分析系统对各个频率信号的处理能力（如滤波器设计）
        `
                    },
                    {
                        id: 10402,
                        title: "系统的稳定性",
                        content: `1.稳定性的定义
    系统稳定性通常指BIBO 稳定性（Bounded-Input Bounded-Output Stability）：如果对任意有界输入 |x(t)| < Mx,系统输出也满足 |y(t)| < My,则称系统为 稳定系统。
    
2.LTI系统稳定性判据
    1) 连续时间系统：
        ∫{-∞,∞} |h(t)|dt < ∞
    2) 离散时间系统：
        ∑ {n=-∞,∞} |h[n]| < ∞
    ****即：冲激响应绝对可积（或绝对可和）→ 系统稳定。****
    
3.频域中的稳定性判据（Z变换或拉普拉斯）
    系统频率响应的收敛域（ROC）必须包含单位圆（离散系统）或 jω 轴（连续系统）：
        ·Z域:  |Z| < 1 在 ROC 内 ⇔ 稳定
        ·S域:  s = jw 在 ROC 内 ⇔ 稳定

4.极点判断法（适用于有理系统）
    系统类型：                                        稳定条件：
    连续时间                                          所有极点实部 < 0（在左半s平面）
    离散时间                                          所有极点模长 < 1（在单位圆内） 
                        `
                    },
                    {
                        id: 10403,
                        title: "系统的因果性",
                        content: `1.因果系统定义
        一个系统称为因果的，如果系统当前输出仅依赖于当前及过去的输入值，不依赖未来输入。
        y[n] = f(x[n],x[n-1],...,x[n-N+1])

2.对冲激响应的判定方法
    ·连续时间：ℎ(𝑡) = 0 for 𝑡 < 0
    ·离散时间：h[n] = 0 for n < 0

3.Z域因果性判断
    对于有理系统函数 H(z)，系统因果的条件是：
        ROC 是 最外层极点的外部区域
        且 H(z) 可以展开为右边序列（正幂级数）
                        `
                    }
                ]
            }
        ]
    },
    {
        id: 2,
        title: "常用傅里叶变换对",
        content: `δ(t)<———————>1
1<———————>2πδ(ω)
ε(t)<———————>πδ(ω)+1/jω
e^-at*ε(t)<———————>1/jω+a
gτ(t)<———————>τ Sa(ωτ/2)
sgn(t)<———————>2/jω`
    },
    {
        id: 3,
        title: "常用拉普拉斯变换对",
        content: `δ(t)<———————>1
1<———————>1/s
t<———————>1/(s^2)
(t^2)/2<———————>1/(s^3)
(t^n)/n<———————>1/(s^(n+1))
e^(-at)<———————>1/(s+a)
te^(-at)<———————>1/((s+a)^2)`
    },
    {
        id: 4,
        title: "常用z变换对",
        content: `δ(n)<———————>1
u(n)<———————>z/(z-1)
nu(n)<———————>z/(z-1)^2
nv^(n-1)u(n)<———————>z/(z-v)^2`
    }
];